Teste_02/app/controllers/order_books_controller.rb

  def index
    @order_books = OrderBook.all
---
SELECT "order_books".* FROM "order_books"

  def create
    @order_book = OrderBook.new(order_book_params)

    respond_to do |format|
      if @order_book.save
---
INSERT INTO "order_books" ("bond_type", "title", "author", "edition", "issn", "year_publication", "publishing_company", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def destroy
    @order_book.destroy
---
DELETE FROM "order_books" WHERE "order_books"."id" = ?  [["id", 58]]

    def set_order_book
      @order_book = OrderBook.find(params[:id])
---
SELECT "order_books".* FROM "order_books" WHERE "order_books"."id" = ? LIMIT ?  [["id", 58], ["LIMIT", 1]]